In [1]:
import numpy as np
import pandas as pd

#### Create dataframe

In [2]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [24, 27, 22, 32, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Salary': [70000, 80000, 65000, 120000, 95000],
    'Experience': [2, 5, 1, 10, 7]
}

In [3]:
df = pd.DataFrame(data)

#### Displaying data types of columns

In [4]:
print("Data types of columns:\n", df.dtypes)

Data types of columns:
 Name          object
Age            int64
City          object
Salary         int64
Experience     int64
dtype: object

#### Converting data types

In [5]:
df['Age'] = df['Age'].astype(np.int64)
print("\nDataFrame after converting Age to float:\n", df.dtypes)

DataFrame after converting Age to float:
 Name          object
Age            int64
City          object
Salary         int64
Experience     int64
dtype: object

#### Setting a column as the index

In [6]:
df.set_index('Name', inplace=True)
print("\nDataFrame after setting Name as index:\n", df)

DataFrame after setting Name as index:
          Age         City  Salary  Experience
Name
Alice     24     New York   70000           2
Bob       27  Los Angeles   80000           5
Charlie   22      Chicago   65000           1
David     32      Houston  120000          10
Eve       29      Phoenix   95000           7

#### Resetting the index

In [7]:
df.reset_index(inplace=True)
print("\nDataFrame after resetting the index:\n", df)

DataFrame after resetting the index:
       Name  Age         City  Salary  Experience
0    Alice   24     New York   70000           2
1      Bob   27  Los Angeles   80000           5
2  Charlie   22      Chicago   65000           1
3    David   32      Houston  120000          10
4      Eve   29      Phoenix   95000           7

### Using the apply function to apply a function to each column

In [8]:
df['Salary in K1'] = df['Salary'].apply(lambda x: x+1)
print("\nDataFrame after applying a function to the Salary column:\n", df)

DataFrame after applying a function to the Salary column:
       Name  Age         City  Salary  Experience  Salary in K1
0    Alice   24     New York   70000           2         70001
1      Bob   27  Los Angeles   80000           5         80001
2  Charlie   22      Chicago   65000           1         65001
3    David   32      Houston  120000          10        120001
4      Eve   29      Phoenix   95000           7         95001

### Using the applymap function to apply a function element-wise

In [9]:
df[['Age', 'Salary']] = df[['Age', 'Salary']].applymap(lambda x: x + 1)
print("\nDataFrame after applying a function element-wise to Age and Salary:\n", df)

DataFrame after applying a function element-wise to Age and Salary:
       Name  Age         City  Salary  Experience  Salary in K1
0    Alice   25     New York   70001           2         70001
1      Bob   28  Los Angeles   80001           5         80001
2  Charlie   23      Chicago   65001           1         65001
3    David   33      Houston  120001          10        120001
4      Eve   30      Phoenix   95001           7         95001

C:\Users\rohit\AppData\Local\Temp\ipykernel_11556\650784304.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df[['Age', 'Salary']] = df[['Age', 'Salary']].applymap(lambda x: x + 1)

### Using the merge function to merge DataFrames

In [10]:
additional_data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Department': ['HR', 'Engineering', 'Marketing', 'Sales', 'Finance']
}
df_additional = pd.DataFrame(additional_data)
merged_df = pd.merge(df, df_additional, on='Name')
print("\nMerged DataFrame:\n", merged_df)

Merged DataFrame:
       Name  Age         City  Salary  Experience  Salary in K1   Department
0    Alice   25     New York   70001           2         70001           HR
1      Bob   28  Los Angeles   80001           5         80001  Engineering
2  Charlie   23      Chicago   65001           1         65001    Marketing
3    David   33      Houston  120001          10        120001        Sales
4      Eve   30      Phoenix   95001           7         95001      Finance

### Using the pivot_table function for data summarization

In [11]:
pivot = df.pivot_table(values='Salary', index='City', columns='Experience', aggfunc=np.mean)
print("\nPivot table of Salary by City and Experience:\n", pivot)

Pivot table of Salary by City and Experience:
 Experience        1        2        5        7         10
City
Chicago      65001.0      NaN      NaN      NaN       NaN
Houston          NaN      NaN      NaN      NaN  120001.0
Los Angeles      NaN      NaN  80001.0      NaN       NaN
New York         NaN  70001.0      NaN      NaN       NaN
Phoenix          NaN      NaN      NaN  95001.0       NaN

C:\Users\rohit\AppData\Local\Temp\ipykernel_11556\1594393871.py:1: FutureWarning: The provided callable <function mean at 0x0000020D70DE1430> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  pivot = df.pivot_table(values='Salary', index='City', columns='Experience', aggfunc=np.mean)

### Using the cut function to segment and sort data into bins

In [16]:
df['Age Group'] = pd.cut(df['Age'], bins=[20, 25, 30, 35], labels=['20-25', '25-30', '30-35'])
print("\nDataFrame after segmenting Age into bins:\n", df)

DataFrame after segmenting Age into bins:
       Name   Age         City  Salary  Experience  Salary in K  \
0    Alice  25.0     New York   70001           2         70.0
1      Bob  28.0  Los Angeles   80001           5         80.0
2  Charlie  23.0      Chicago   65001           1         65.0
3    David  33.0      Houston  120001          10        120.0
4      Eve  30.0      Phoenix   95001           7         95.0

  City Abbreviation Age Group
0                NY     20-25
1                LA     25-30
2               CHI     20-25
3               HOU     30-35
4               PHX     25-30

### Using the isin function to filter DataFrame based on a list of values

In [19]:
filtered_df = df[df['City'].isin(['New York', 'Chicago'])]
print("\nFiltered DataFrame with cities New York and Chicago:\n", filtered_df)

Filtered DataFrame with cities New York and Chicago:
       Name   Age      City  Salary  Experience  Salary in K City Abbreviation  \
0    Alice  25.0  New York   70001           2         70.0                NY
2  Charlie  23.0   Chicago   65001           1         65.0               CHI

  Age Group Salary Quantile
0     20-25              Q1
2     20-25              Q1

### Using the rank function to compute numerical data ranks

In [20]:
df['Salary Rank'] = df['Salary'].rank()
print("\nDataFrame after computing salary ranks:\n", df)

DataFrame after computing salary ranks:
       Name   Age         City  Salary  Experience  Salary in K  \
0    Alice  25.0     New York   70001           2         70.0
1      Bob  28.0  Los Angeles   80001           5         80.0
2  Charlie  23.0      Chicago   65001           1         65.0
3    David  33.0      Houston  120001          10        120.0
4      Eve  30.0      Phoenix   95001           7         95.0

  City Abbreviation Age Group Salary Quantile  Salary Rank
0                NY     20-25              Q1          2.0
1                LA     25-30              Q2          3.0
2               CHI     20-25              Q1          1.0
3               HOU     30-35              Q4          5.0
4               PHX     25-30              Q3          4.0

### Saving DataFrame to an Excel file

In [12]:
df.to_excel('employee_data.xlsx', index=False)
print("\nDataFrame saved to 'employee_data.xlsx'")

DataFrame saved to 'employee_data.xlsx'

### Reading DataFrame from an Excel file

In [22]:
df_from_excel = pd.read_excel('employee_data.xlsx')
print("\nDataFrame read from 'employee_data.xlsx':\n", df_from_excel)

DataFrame read from 'employee_data.xlsx':
       Name  Age         City  Salary  Experience  Salary in K  \
0    Alice   25     New York   70001           2           70
1      Bob   28  Los Angeles   80001           5           80
2  Charlie   23      Chicago   65001           1           65
3    David   33      Houston  120001          10          120
4      Eve   30      Phoenix   95001           7           95

  City Abbreviation Age Group Salary Quantile  Salary Rank
0                NY     20-25              Q1            2
1                LA     25-30              Q2            3
2               CHI     20-25              Q1            1
3               HOU     30-35              Q4            5
4               PHX     25-30              Q3            4